#!/bin/bash

echo "=== Информация о времени безотказной работы системы ==="
uptime

echo "=== Общая загрузка ЦП ==="
LANG=C top -bn1 | awk -F',' '/%Cpu/ {print "Загрузка: " 100-$4 "%"}'

echo "=== Использование памяти ==="
free -m | awk '/^Mem:/ {printf "Всего: %.1fGi\nЗанято: %.1fGi (%.2f%%)\nСвободно: %.1fGi (%.2f%%)\n", $2/1024, $3/1024, $3/$2 * 100, $4/1024, $4/$2 * 100}'

echo "=== Использование диска ==="
df -h | grep "/" -w | awk '{printf "Всего: %sG\nЗанято: %s (%.2f%%)\nСвободно: %s (%.2f%%)\n",$3 + $4, $3, $3/($3+$4) * 100, $4, $4/($3+$4) * 100}'
echo "=== Топ-5 процессов по загрузке памяти ==="
ps aux --sort=-%mem | awk 'NR==1 || NR<=6 {printf "%-10s %-6s %-5s %s\n", $1, $2, $4, $11}'

echo "===Топ-5 процессов по загрузке памяти ==="
ps aux --sort=-%cpu | awk 'NR==1 || NR<=6 {printf "%-10s %-6s %-5s %s\n", $1, $2, $3, $11}'
